In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'grammer':['Python','C','Java','Go',np.nan,'SQL','PHP','Python'],
       'score':[1,2,np.nan,4,5,6,7,10]}
data

{'grammer': ['Python', 'C', 'Java', 'Go', nan, 'SQL', 'PHP', 'Python'],
 'score': [1, 2, nan, 4, 5, 6, 7, 10]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [6]:
df.head()

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0

In [7]:
df.tail()

  grammer  score
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [8]:
df.dtypes

grammer     object
score      float64
dtype: object

In [9]:
df.shape # 数据形态

(8, 2)

In [11]:
df.shape[0]

8

In [12]:
df.size

16

In [13]:
df.index  # 隐形索引 左闭右开

RangeIndex(start=0, stop=8, step=1)

In [14]:
df.columns

Index(['grammer', 'score'], dtype='object')

In [15]:
df.values

array([['Python', 1.0],
       ['C', 2.0],
       ['Java', nan],
       ['Go', 4.0],
       [nan, 5.0],
       ['SQL', 6.0],
       ['PHP', 7.0],
       ['Python', 10.0]], dtype=object)

In [16]:
df.value_counts()

grammer  score
C        2.0      1
Go       4.0      1
PHP      7.0      1
Python   1.0      1
         10.0     1
SQL      6.0      1
dtype: int64

In [17]:
df['grammer'].value_counts()

Python    2
C         1
Java      1
Go        1
SQL       1
PHP       1
Name: grammer, dtype: int64

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   grammer  7 non-null      object
 1   score    7 non-null      float64
dtypes: float64(1), object(1)
memory usage: 256.0+ bytes

In [19]:
df.set_index('grammer')

         score
grammer
Python     1.0
C          2.0
Java       NaN
Go         4.0
NaN        5.0
SQL        6.0
PHP        7.0
Python    10.0

In [20]:
df.reset_index()

   index grammer  score
0      0  Python    1.0
1      1       C    2.0
2      2    Java    NaN
3      3      Go    4.0
4      4     NaN    5.0
5      5     SQL    6.0
6      6     PHP    7.0
7      7  Python   10.0

In [21]:
df.reset_index(drop=True)

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [22]:
df.rename(columns={'score':'popilarity'})

  grammer  popilarity
0  Python         1.0
1       C         2.0
2    Java         NaN
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [23]:
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [24]:
df.rename(columns={'score':'popilarity'},inplace=True)

In [25]:
df

  grammer  popilarity
0  Python         1.0
1       C         2.0
2    Java         NaN
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [28]:
df.rename(index={1:9})

  grammer  popilarity
0  Python         1.0
9       C         2.0
2    Java         NaN
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [29]:
df

  grammer  popilarity
0  Python         1.0
1       C         2.0
2    Java         NaN
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [30]:
df['popilarity'].mean()

5.0

In [31]:
# 填充缺失值 fillna dropna

df['popilarity'].fillna(df['popilarity'].mean())

0     1.0
1     2.0
2     5.0
3     4.0
4     5.0
5     6.0
6     7.0
7    10.0
Name: popilarity, dtype: float64

In [32]:
df

  grammer  popilarity
0  Python         1.0
1       C         2.0
2    Java         NaN
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [33]:
df['popilarity'] = df['popilarity'].fillna(df['popilarity'].mean())

In [34]:
df

  grammer  popilarity
0  Python         1.0
1       C         2.0
2    Java         5.0
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [37]:
df['grammer'] =='Python'

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: grammer, dtype: bool

In [38]:
df[df['grammer'] =='Python']

  grammer  popilarity
0  Python         1.0
7  Python        10.0

In [42]:
# 取popilarity > 3 && < 7 的数据行
df['popilarity'] > 3

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7     True
Name: popilarity, dtype: bool

In [43]:
df['popilarity'] <7

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
Name: popilarity, dtype: bool

In [44]:
(df['popilarity'] >3)&(df['popilarity'] <7)

0    False
1    False
2     True
3     True
4     True
5     True
6    False
7    False
Name: popilarity, dtype: bool

In [45]:
df[(df['popilarity'] >3)&(df['popilarity'] <7)]

  grammer  popilarity
2    Java         5.0
3      Go         4.0
4     NaN         5.0
5     SQL         6.0

In [46]:
# 取重复值
df['popilarity'].duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: popilarity, dtype: bool

In [47]:
df.duplicated('popilarity')

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

In [48]:
df.duplicated(['popilarity'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

In [50]:
df.drop_duplicates('popilarity',keep='last')

  grammer  popilarity
0  Python         1.0
1       C         2.0
3      Go         4.0
4     NaN         5.0
5     SQL         6.0
6     PHP         7.0
7  Python        10.0

In [51]:
type(df['grammer'])

pandas.core.series.Series

In [52]:
# 转出list dict
df['grammer'].to_list()

['Python', 'C', 'Java', 'Go', nan, 'SQL', 'PHP', 'Python']

In [53]:
df.to_excel('test.xlsx')

In [54]:
df2=pd.read_excel('test.xlsx')
df2

   Unnamed: 0 grammer  popilarity
0           0  Python           1
1           1       C           2
2           2    Java           5
3           3      Go           4
4           4     NaN           5
5           5     SQL           6
6           6     PHP           7
7           7  Python          10

In [55]:
df.to_excel('test.xlsx',index=False)

In [56]:
df2=pd.read_excel('test.xlsx')
df2

  grammer  popilarity
0  Python           1
1       C           2
2    Java           5
3      Go           4
4     NaN           5
5     SQL           6
6     PHP           7
7  Python          10

In [58]:
df = pd.DataFrame(data)
df

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0

In [60]:
#max min
df['score'].max()

10.0

In [61]:
df['score']==df['score'].max()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: score, dtype: bool

In [62]:
df[df['score']==df['score'].max()]

  grammer  score
7  Python   10.0

In [66]:
# 删除最后一行 drop del

df.drop(df.shape[0]-1)

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0

In [68]:
# len(df)
len(df)

8

In [70]:
s = pd.Series({'grammer':'Perl','score':6.6})
s

grammer    Perl
score       6.6
dtype: object

In [72]:
df.append(s,ignore_index=True)

/var/folders/wv/c3nyq5k95t7_6t56sxlw3s4c0000gn/T/ipykernel_58332/1925300445.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(s,ignore_index=True)

  grammer  score
0  Python    1.0
1       C    2.0
2    Java    NaN
3      Go    4.0
4     NaN    5.0
5     SQL    6.0
6     PHP    7.0
7  Python   10.0
8    Perl    6.6

In [74]:
# sort
df.sort_values('score',ascending=False)

  grammer  score
7  Python   10.0
6     PHP    7.0
5     SQL    6.0
4     NaN    5.0
3      Go    4.0
1       C    2.0
0  Python    1.0
2    Java    NaN

In [79]:
# map apply

def lenth(x):
    print(type(x))
    return len(x)
df['grammer'].apply(lenth)

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'float'>

TypeError: object of type 'float' has no len()

In [80]:
df.isnull()

   grammer  score
0    False  False
1    False  False
2    False   True
3    False  False
4     True  False
5    False  False
6    False  False
7    False  False

In [83]:
data = {'createTime':['2020-03-12 11:30:33','2020-04-02 11:30:33','2020-05-12 21:30:33','2020-03-21 01:04:33','2020-03-12 11:30:53','2021-05-12 11:20:43','2022-09-12 13:01:03'],
       'eductaion':['本科','本科','不限','硕士','本科','本科','硕士'],'salary':['20k-25k','10k-20k','15k-25k','20k-50k','20k-40k','10k-25k','35k-50k']}
df = pd.DataFrame(data)
df

            createTime eductaion   salary
0  2020-03-12 11:30:33        本科  20k-25k
1  2020-04-02 11:30:33        本科  10k-20k
2  2020-05-12 21:30:33        不限  15k-25k
3  2020-03-21 01:04:33        硕士  20k-50k
4  2020-03-12 11:30:53        本科  20k-40k
5  2021-05-12 11:20:43        本科  10k-25k
6  2022-09-12 13:01:03        硕士  35k-50k

In [85]:
# salary 平均
df.iloc[0,2]

'20k-25k'

In [91]:
def func(x):
    list = x.split('-')
    print(list)
    smin= int(list[0].strip('k'))
    smax= int(list[1].strip('k'))
    return str((smin+smax) / 2) + 'k'

df['salary'].apply(func)

['20k', '25k']
['10k', '20k']
['15k', '25k']
['20k', '50k']
['20k', '40k']
['10k', '25k']
['35k', '50k']

0    22.5k
1    15.0k
2    20.0k
3    35.0k
4    30.0k
5    17.5k
6    42.5k
Name: salary, dtype: object

In [98]:
def func(x):
    list = x['salary'].split('-')
    print(list)
    smin= int(list[0].strip('k'))
    smax= int(list[1].strip('k'))
    return (smin+smax) / 2 *1000

df.apply(func,axis=1)

['20k', '25k']
['10k', '20k']
['15k', '25k']
['20k', '50k']
['20k', '40k']
['10k', '25k']
['35k', '50k']

0    22500.0
1    15000.0
2    20000.0
3    35000.0
4    30000.0
5    17500.0
6    42500.0
dtype: float64

In [100]:
df['avg_salary'] = df.apply(func,axis=1)

['20k', '25k']
['10k', '20k']
['15k', '25k']
['20k', '50k']
['20k', '40k']
['10k', '25k']
['35k', '50k']

In [101]:
df

            createTime eductaion   salary  avg_salary
0  2020-03-12 11:30:33        本科  20k-25k     22500.0
1  2020-04-02 11:30:33        本科  10k-20k     15000.0
2  2020-05-12 21:30:33        不限  15k-25k     20000.0
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0
4  2020-03-12 11:30:53        本科  20k-40k     30000.0
5  2021-05-12 11:20:43        本科  10k-25k     17500.0
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0

In [102]:
# 根据学历分组 整体薪资水平
df.groupby('eductaion').get_group('本科')

            createTime eductaion   salary  avg_salary
0  2020-03-12 11:30:33        本科  20k-25k     22500.0
1  2020-04-02 11:30:33        本科  10k-20k     15000.0
4  2020-03-12 11:30:53        本科  20k-40k     30000.0
5  2021-05-12 11:20:43        本科  10k-25k     17500.0

In [103]:
print(df.groupby('eductaion').mean())

           avg_salary
eductaion
不限            20000.0
本科            21250.0
硕士            38750.0

In [104]:
df.describe()

         avg_salary
count      7.000000
mean   26071.428571
std    10088.890637
min    15000.000000
25%    18750.000000
50%    22500.000000
75%    32500.000000
max    42500.000000

In [107]:
# 数组分组 cut
ages =[20,22,25,27,21,23,37,32,62,45,41,32] # 18 to 25,26 to 35,36 to 60,61以上
bins= [18,25,35,60,100]
cats =pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [108]:
cats.codes  # 查看数据在哪个分组中

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [109]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [110]:
# 给分组添加标签
group_names = ['Youth','YouthAduit','MiddieAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YouthAduit', 'Youth', ..., 'YouthAduit', 'Senior', 'MiddieAged', 'MiddieAged', 'YouthAduit']
Length: 12
Categories (4, object): ['Youth' < 'YouthAduit' < 'MiddieAged' < 'Senior']

In [112]:
groups = pd.cut(ages,bins,labels=group_names)
groups.value_counts()

Youth         5
YouthAduit    3
MiddieAged    3
Senior        1
dtype: int64

In [114]:
# precision 保留位数
data = np.random.rand(20)
groups = pd.cut(data,4,precision=2)
groups

[(0.25, 0.5], (0.75, 0.99], (0.75, 0.99], (0.0021, 0.25], (0.75, 0.99], ..., (0.0021, 0.25], (0.0021, 0.25], (0.25, 0.5], (0.0021, 0.25], (0.5, 0.75]]
Length: 20
Categories (4, interval[float64, right]): [(0.0021, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [115]:
groups.value_counts()

(0.0021, 0.25]    8
(0.25, 0.5]       2
(0.5, 0.75]       6
(0.75, 0.99]      4
dtype: int64

In [116]:
# pd.qcut 按照百分位数分组，每个分组里都有相同数目的观察值
data = np.random.randn(1000)
cats = pd.qcut(data , 4,precision=100)
cats

[(-3.4357083330896128, -0.6766041753623564], (0.004218126023171721, 0.6950293191709365], (-0.6766041753623564, 0.004218126023171721], (-0.6766041753623564, 0.004218126023171721], (0.6950293191709365, 3.3106603353260917], ..., (-3.4357083330896128, -0.6766041753623564], (0.004218126023171721, 0.6950293191709365], (0.6950293191709365, 3.3106603353260917], (0.004218126023171721, 0.6950293191709365], (0.004218126023171721, 0.6950293191709365]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4357083330896128, -0.6766041753623564] < (-0.6766041753623564, 0.004218126023171721] < (0.004218126023171721, 0.6950293191709365] < (0.6950293191709365, 3.3106603353260917]]

In [117]:
cats.value_counts()

(-3.4357083330896128, -0.6766041753623564]     250
(-0.6766041753623564, 0.004218126023171721]    250
(0.004218126023171721, 0.6950293191709365]     250
(0.6950293191709365, 3.3106603353260917]       250
dtype: int64

In [118]:
df

            createTime eductaion   salary  avg_salary
0  2020-03-12 11:30:33        本科  20k-25k     22500.0
1  2020-04-02 11:30:33        本科  10k-20k     15000.0
2  2020-05-12 21:30:33        不限  15k-25k     20000.0
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0
4  2020-03-12 11:30:53        本科  20k-40k     30000.0
5  2021-05-12 11:20:43        本科  10k-25k     17500.0
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0

In [120]:
bins = [0,5000,20000,50000]
group_name = ['低','中','高']
df['categories']=pd.cut(df['avg_salary'],bins,labels = group_name)

In [121]:
df

            createTime eductaion   salary  avg_salary categories
0  2020-03-12 11:30:33        本科  20k-25k     22500.0          高
1  2020-04-02 11:30:33        本科  10k-20k     15000.0          中
2  2020-05-12 21:30:33        不限  15k-25k     20000.0          中
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0          高
4  2020-03-12 11:30:53        本科  20k-40k     30000.0          高
5  2021-05-12 11:20:43        本科  10k-25k     17500.0          中
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0          高

In [122]:
df.sort_values('avg_salary',ascending=False)

            createTime eductaion   salary  avg_salary categories
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0          高
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0          高
4  2020-03-12 11:30:53        本科  20k-40k     30000.0          高
0  2020-03-12 11:30:33        本科  20k-25k     22500.0          高
2  2020-05-12 21:30:33        不限  15k-25k     20000.0          中
5  2021-05-12 11:20:43        本科  10k-25k     17500.0          中
1  2020-04-02 11:30:33        本科  10k-20k     15000.0          中

In [123]:
df.loc[5,'salary']

'10k-25k'

In [124]:
df.iloc[4:5,1:]

  eductaion   salary  avg_salary categories
4        本科  20k-40k     30000.0          高

In [125]:
df.drop(columns='createTime',inplace=False)

  eductaion   salary  avg_salary categories
0        本科  20k-25k     22500.0          高
1        本科  10k-20k     15000.0          中
2        不限  15k-25k     20000.0          中
3        硕士  20k-50k     35000.0          高
4        本科  20k-40k     30000.0          高
5        本科  10k-25k     17500.0          中
6        硕士  35k-50k     42500.0          高

In [126]:
# 合并列
df['test1'] = df['avg_salary'].astype(str) + df['eductaion']

In [127]:
df

            createTime eductaion   salary  avg_salary categories      test1
0  2020-03-12 11:30:33        本科  20k-25k     22500.0          高  22500.0本科
1  2020-04-02 11:30:33        本科  10k-20k     15000.0          中  15000.0本科
2  2020-05-12 21:30:33        不限  15k-25k     20000.0          中  20000.0不限
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0          高  35000.0硕士
4  2020-03-12 11:30:53        本科  20k-40k     30000.0          高  30000.0本科
5  2021-05-12 11:20:43        本科  10k-25k     17500.0          中  17500.0本科
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0          高  42500.0硕士

In [129]:
# concat
pd.concat([df[:1],df[-1:]])

            createTime eductaion   salary  avg_salary categories      test1
0  2020-03-12 11:30:33        本科  20k-25k     22500.0          高  22500.0本科
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0          高  42500.0硕士

In [130]:
df.isnull().any()

createTime    False
eductaion     False
salary        False
avg_salary    False
categories    False
test1         False
dtype: bool

In [131]:
df.isnull().sum()

createTime    0
eductaion     0
salary        0
avg_salary    0
categories    0
test1         0
dtype: int64

In [132]:
df['avg_salary'].astype(float)

0    22500.0
1    15000.0
2    20000.0
3    35000.0
4    30000.0
5    17500.0
6    42500.0
Name: avg_salary, dtype: float64

In [133]:
df[df['avg_salary'] > 10000]

            createTime eductaion   salary  avg_salary categories      test1
0  2020-03-12 11:30:33        本科  20k-25k     22500.0          高  22500.0本科
1  2020-04-02 11:30:33        本科  10k-20k     15000.0          中  15000.0本科
2  2020-05-12 21:30:33        不限  15k-25k     20000.0          中  20000.0不限
3  2020-03-21 01:04:33        硕士  20k-50k     35000.0          高  35000.0硕士
4  2020-03-12 11:30:53        本科  20k-40k     30000.0          高  30000.0本科
5  2021-05-12 11:20:43        本科  10k-25k     17500.0          中  17500.0本科
6  2022-09-12 13:01:03        硕士  35k-50k     42500.0          高  42500.0硕士

In [134]:
len(df['avg_salary'].astype(str))

7

In [135]:
df['eductaion'].value_counts()

本科    4
硕士    2
不限    1
Name: eductaion, dtype: int64

In [136]:
df['eductaion'].nunique()

3

In [137]:
df['eductaion'].unique()

array(['本科', '不限', '硕士'], dtype=object)